{
    "sentences": [
      "Sure, I'm looking into that for you right now.",
      "Absolutely, give me a sec to check on that.",
      "Of course, let me see what I can find out.",
      "Certainly, I'm just pulling up that information.",
      "You bet, hang on while I check something real quick.",
      "No problem, I need to look that up. Won't take long.",
      "Gladly, let me dig into that for a moment.",
      "Definitely, I'm just checking the details for you.",
      "Right away, give me a minute to find the right info.",
      "Happy to, I'm working on getting that answer for you.",
      "Alright, let me make sure I have the latest information.",
      "Will do, I'm just looking into a few things.",
      "Got it, give me a moment to sort through this.",
      "No worries, I'm looking for the most up-to-date info on that.",
      "Sure thing, hang tight while I find what you need.",
      "Absolutely, I'm just making sure I get this right for you.",
      "Of course, let me pull together the details real quick.",
      "Certainly, I'm searching for the best answer to your question.",
      "You bet, give me a sec to gather all the information.",
      "No problem, I'm just checking our latest updates on that.",
      "Gladly, let me make sure nothing's changed recently.",
      "Definitely, I want to check before I answer that.",
      "Right away, give me a minute to look through our resources.",
      "Happy to, I'm just making sure I don't miss anything important.",
      "Alright, hang on while I find the most relevant information.",
      "Will do, let me see if I can track down a clear answer for you.",
      "Got it, I'm just making sure I understand your question fully.",
      "No worries, give me a moment to find the specifics on that.",
      "Sure thing, I'm looking into the details as we speak.",
      "Absolutely, let me check with our most recent information.",
      "Of course, I'm just making sure I have all the facts straight.",
      "Certainly, give me a sec to pull up the correct information.",
      "You bet, I'm searching for the most accurate answer.",
      "No problem, let me see if there's any new information on that.",
      "Gladly, I'm just confirming a few details for you.",
      "Definitely, hang on while I find the best way to explain this.",
      "Right away, let me check if anything's changed recently.",
      "Happy to, I'm just making sure I give you the right information.",
      "Alright, give me a minute to look into that thoroughly.",
      "Will do, I'm searching for a clear explanation for you.",
      "Got it, let me see if I can simplify this for you.",
      "No worries, I'm just making sure I cover all aspects of your question.",
      "Sure thing, give me a sec to find the most relevant details.",
      "Absolutely, I'm looking for the clearest way to answer that.",
      "Of course, let me see what I find.",
      "Certainly, I'm just making sure I don't overlook anything.",
      "You bet, hang on while I find the best answer.",
      "No problem, let me see if there's a quicker way to explain this.",
      "Gladly, I'm just checking for the latest information on that.",
      "Definitely, give me a moment to find the most helpful information.",
      "Right away, I'm looking for any recent updates on this topic.",
      "Happy to, let me see if I can break this down more simply.",
      "Alright, I'm just making sure I address all parts of your question.",
      "Will do, give me a sec to find the best answer for you.",
      "Got it, I'm searching for any additional information that might help.",
      "No worries, let me check if there's a better way to approach this.",
      "Sure thing, I'm just looking into that for you.",
      "Absolutely, hang on while I find a good answer for you.",
      "Of course, let me see what I find.",
      "Certainly, I'm just making sure this is the best answer for your question.",
      "You bet, give me a moment to find the most reliable information on this.",
      "No problem, I'm looking into that for you now.",
      "Gladly, let me check if there have been any recent updates.",
      "Definitely, I'm just making sure I'm not missing any crucial details.",
      "Right away, hang on while I find the most current information.",
      "Happy to, let me see if there's an easier way to explain this.",
      "Alright, I'm just double-checking to ensure accuracy.",
      "Will do, give me a sec to find any relevant updates.",
      "Got it, I'm searching for the best solution for you.",
      "No worries, let me check on that for you.",
      "Sure thing, I'm just making sure I have the full context.",
      "Absolutely, give me a moment to find the best answer for this.",
      "Of course, I'm looking for any helpful information on that.",
      "You bet, I'm just checking on that for you.",
      "No problem, hang on while I find the best answer.",
      "Gladly, let me check on that for you.",
      "Definitely, I'm just making sure I provide all necessary information.",
      "Right away, give me a minute to look into that further.",
      "Happy to, I'm searching for the clearest explanation.",
      "Alright, let me see if there's anything else you should know about this.",
      "Will do, I'm just making sure this is the best answer for you.",
      "Got it, give me a sec to find any additional information.",
      "No worries, I'm looking for the most current information on this.",
      "Sure thing, let me check if there's anything else about this.",
      "Absolutely, I'm just making sure I'm giving you the full picture.",
      "Of course, hang on while I find any relevant information.",
      "Certainly, let me see if there's a better answer.",
      "You bet, I'm just double-checking on that for you.",
      "No problem, give me a moment to find the most relevant information.",
      "Gladly, I'm looking into that for you now.",
      "Definitely, let me check if there's anything new on this.",
      "Right away, I'm just making sure I'm not overlooking anything.",
      "Happy to, give me a sec to find the best information on this.",
      "Alright, I'm searching for any helpful sources on that.",
      "Will do, let me see if there's a simpler answer.",
      "Got it, I'm just checking on that for you.",
      "No worries, hang on while I find the latest information on this.",
      "Sure thing, let me check on that for you.",
      "Absolutely, I'm just making sure I'm providing the most helpful information possible.",
      "You got it. Checking for the best sources."
    ]
  }  